config.org
**** Configuração
#+begin_src elisp :tangle tangle/major/org.el :noweb yes
;;; tangle/major/org.el -*- lexical-binding: t; -*-
(require 'org-src)
(add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t)))

(add-hook! org-mode
    <<org-mode-hook>>
    )

(set-popup-rule! "\*Org Src .+\*"
  :size 0.5)

(setq org-preview-latex-default-process 'dvisvgm)
(plist-put org-format-latex-options :scale 1.3)

(add-to-list
 '+company-backend-alist
 '(org-mode company-math-symbols-latex))

(map! :map 'evil-org-mode-map
      :i "C-l" #'flyspell-correct-move)

(after! ox-latex
  (add-to-list 'org-latex-classes
            '("report-noparts"
                "\\documentclass{report}"
                ("\\chapter{%s}" . "\\chapter*{%s}")
                ("\\section{%s}" . "\\section*{%s}")
                ("\\subsection{%s}" . "\\subsection*{%s}")
                ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                ("\\paragraph{%s}" . "\\paragraph*{%s}")
                ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(map! :mode 'org-mode :g "C-S-s" #'org-latex-export-to-pdf)
#+end_src

**** Hook

#+begin_src emacs-lisp :tangle no :noweb-ref org-mode-hook
(auto-fill-mode +1)
(setq-local real-auto-save-interval 0.2)
(ws-butler-mode -1)
#+end_src

**** Esconder =:properties:=

Roubado do manual do Roam v2 (ou algo assim).

#+begin_src elisp :tangle tangle/major/org.el
(defun my/org-hide-properties ()
  "Hide all org-mode headline property drawers in buffer. Could be
slow if it has a lot of overlays."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward
            "^ *:properties:\n\\( *:.+?:.*\n\\)+ *:end:\n" nil t)
      (let ((ov_this (make-overlay (match-beginning 0) (match-end 0))))
        (overlay-put ov_this 'display "")
        (overlay-put ov_this 'hidden-prop-drawer t))))
  (put 'org-toggle-properties-hide-state 'state 'hidden))

(defun my/org-show-properties ()
  "Show all org-mode property drawers hidden by org-hide-properties."
  (interactive)
  (remove-overlays (point-min) (point-max) 'hidden-prop-drawer t)
  (put 'org-toggle-properties-hide-state 'state 'shown))

(defun my/org-toggle-properties ()
  "Toggle visibility of property drawers."
  (interactive)
  (if (eq (get 'org-toggle-properties-hide-state 'state) 'hidden)
      (org-show-properties)
    (org-hide-properties)))
#+end_src

#+begin_src emacs-lisp :tangle no :noweb-ref org-mode-hook
(my/org-hide-properties)
#+end_src
*** Haskell
#+begin_src emacs-lisp
(setq lsp-haskell-server-path "~/.local/bin/haskell-language-server-wrapper")
#+end_src

** Features
*** Ispell

#+begin_src emacs-lisp
(setq ispell-dictionary "pt_BR,en_US"
      ispell-personal-dictionary (concat doom-private-dir ".hunspell-personal"))

(unless (file-exists-p ispell-personal-dictionary)
  (write-region "" nil ispell-personal-dictionary nil 0))
#+end_src

Cria um dicionário multilinguagem com português e inglês.

#+begin_src elisp
(after! ispell
  (ispell-hunspell-add-multi-dic "pt_BR,en_US")
  (ispell-set-spellchecker-params))
#+end_src
*** Orderless
Também quero que tenha inicialismos (por exemplo, hmlm -> hide-mode-line-mode):
#+begin_src emacs-lisp
(setq orderless-matching-styles
      '(orderless-initialism
        orderless-literal
        orderless-regexp))
#+end_src
*** Org
**** Org-roam
#+begin_src emacs-lisp
(setq org-roam-directory "~/Lucas/notas"
      +org-roam-open-buffer-on-find-file nil)
#+end_src

#+begin_src elisp :tangle tangle/feature/org-roam.el
;;; tangle/feature/org-roam.el -*- lexical-binding: t; -*-

(defadvice! +org-roam-reuse-windows (&rest r)
  :before #'org-roam-preview-visit
  :before #'org-roam-node-visit
  (when org-roam-buffer-current-node
    (let ((window (get-buffer-window
                    (get-file-buffer
                      (org-roam-node-file org-roam-buffer-current-node)))))
      (when window (select-window window)))))

(defadvice! doom-modeline--buffer-file-name-roam-aware-a (orig-fun)
  :around #'doom-modeline-buffer-file-name ; takes no args
  (if (s-contains-p (expand-file-name org-roam-directory) (or buffer-file-name ""))
      (replace-regexp-in-string
       "\\(?:^\\|.*/\\)\\([0-9]\\{4\\}\\)\\([0-9]\\{2\\}\\)\\([0-9]\\{2\\}\\)[0-9]*-"
       "🢔(\\1-\\2-\\3) "
       (subst-char-in-string ?_ ?  buffer-file-name))
    (funcall orig-fun)))
#+end_src

**** Org-roam-ui
#+begin_src elisp :tangle packages.el
(package! websocket)
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
#+end_src

#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t))
#+end_src

**** TODO Org-ql
#+begin_src emacs-lisp :tangle packages.el
(package! org-ql)
#+end_src

**** Org-sidebar :ARCHIVE:
#+begin_src emacs-lisp :tangle packages.el
(package! org-sidebar)
#+end_src

#+begin_src emacs-lisp
(after! org-sidebar
  (defun :org-sidebar-refresh ()
    (interactive)
    (let* ((source-buffer (current-buffer))
           (sidebar-window (--first (window-parameter it 'org-sidebar-window)
                                    (window-at-side-list nil org-sidebar-side))))
      (when sidebar-window
        (with-current-buffer (window-buffer sidebar-window)
          (when (eq org-sidebar-source-buffer source-buffer)
            (org-sidebar-refresh)))))))
#+end_src
.
*** Projectile
#+begin_src emacs-lisp
(after! projectile
    (projectile-register-project-type 'julia '("Project.toml")
                                    :project-file "Project.toml"
                                    :test "julia -e \"using Pkg; Pkg.test()\""))
#+end_src
*** Temas
#+begin_src elisp :tangle packages.el
(package! seoul256-theme)
#+end_src


*** Treemacs
**** Ignorar (esconder) algumas coisas

Roubado do tecosaur.

#+begin_src emacs-lisp
(defcustom treemacs-file-ignore-extensions
  '("aux" "ptc" "fdb_latexmk" "fls" "synctex.gz" "toc"         ;; LaTeX
    "glg"  "glo"  "gls"  "glsdefs"  "ist"  "acn"  "acr"  "alg" ;; LaTeX - glossary
    "mw"                                                       ;; LaTeX - pgfplots
    "pdfa.xmpi")                                               ;; LaTeX - pdfx
  "File extension which `treemacs-ignore-filter' will ensure are ignored"
  :safe #'string-list-p)

(defcustom treemacs-file-ignore-globs
  '("*/_minted-*"                                        ;; LaTeX
     "*/.auctex-auto" "*/_region_.log" "*/_region_.tex") ;; AucTeX
  "Globs which will are transformed to `treemacs-file-ignore-regexps'
which `treemacs-ignore-filter' will ensure are ignored"
  :safe #'string-list-p)
#+end_src

**** Fringe only appears with width > 5
#+begin_src emacs-lisp
(setq doom-themes-treemacs-bitmap-indicator-width 8)
#+end_src

** Minor modes
*** Centaur-tabs :ARCHIVE:

#+begin_src elisp :tangle tangle/minor/centaur-tabs.el
;;; tangle/minor/centaur-tabs.el -*- lexical-binding: t; -*-
(defun centaur-tabs-buffer-groups ()
  "`centaur-tabs-buffer-groups' control buffers' group rules.

    Group centaur-tabs with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
    All buffer name start with * will group to \"Emacs\".
    Other buffer group by `centaur-tabs-get-group-name' with project name."
  (list
   (cond
    ((derived-mode-p 'prog-mode)
     "Editing")
    ((derived-mode-p 'dired-mode)
     "Dired")
    ((memq major-mode '(helpful-mode
                        help-mode))
     "Help")
    ((memq major-mode '(org-mode
                        org-agenda-clockreport-mode
                        org-src-mode
                        org-agenda-mode
                        org-beamer-mode
                        org-indent-mode
                        org-bullets-mode
                        org-cdlatex-mode
                        org-agenda-log-mode
                        diary-mode))
     "OrgMode")
    ((memq major-mode '(vterm-mode
                        term-mode
                        julia-repl-mode))
     "TermMode")
    ((or (string-equal "*" (substring (buffer-name) 0 1))
         (memq major-mode '(magit-process-mode
                            magit-status-mode
                            magit-diff-mode
                            magit-log-mode
                            magit-file-mode
                            magit-blob-mode
                            magit-blame-mode)))
     "Emacs")
    (t
     (centaur-tabs-get-group-name (current-buffer))))))


(setq centaur-tabs-style "bar"
      centaur-tabs-set-bar nil
      centaur-tabs-height 36
      centaur-tabs-plain-icons t
      centaur-tabs-label-fixed-length 10)

(after! centaur-tabs
  (centaur-tabs-group-by-projectile-project))
#+end_src
 
*** Company
**** Company-box # ainda não sei se precisa :ARCHIVE:

#+begin_src elisp :tangle tangle/minor/company-box.el
;;; tangle/minor/company-box.el -*- lexical-binding: t; -*-
(defadvice! my/company-box-ensure-window-exists (&rest _)
  :before #'company-box--move-selection
  (unless (get-buffer-window (company-box--get-buffer) t)
    (company-box--set-frame (company-box--get-frame)))) ; or company-box--make-frame ?
#+end_src

*** Elcord

#+begin_src elisp :tangle packages.el
(package! elcord)
#+end_src

#+begin_src emacs-lisp
(setq elcord-editor-icon "emacs_icon"
      elcord-display-elapsed nil
      elcord--editor-name "Emacs"
      elcord-use-major-mode-as-main-icon t)
#+end_src

*** Evil
**** Variáveis
#+begin_src emacs-lisp
(setq evil-shift-round nil
      evil-cross-lines t

      ;; Respeita linhas visuais
      evil-respect-visual-line-mode t

      ;; Substitui vários matches por linha no evil-ex
      evil-ex-substitute-global t)
#+end_src

**** FIXME Shift (não funciona 😕)
Eu /realmente/ quero que o shift tenha 2 espaços na linguagem elisp.
#+begin_src elisp :tangle tangle/minor/evil.el
;;; tangle/minor/evil.el -*- lexical-binding: t; -*-
(defadvice! ~evil-shift-width-elisp-advice (fun &rest r)
  :around #'evil-shift-width-elisp-advice
  (if (eq major-mode 'emacs-lisp-mode)
      (setq evil-shift-width 2)
    (apply fun r)))
#+end_src

**** Evil-mc
Multicursores com o Ctrl + clique esquerdo do mouse (como no VSCode).
#+begin_src elisp :tangle tangle/minor/evil.el
(defun evil-mc/toggle-cursor-on-click (event)
  "Add a cursor where you click, or remove a fake cursor that is
already there."
  (interactive "e")
  (mouse-minibuffer-check event)
  (require 'evil-mc)
  ;; Use event-end in case called from mouse-drag-region.
  ;; If EVENT is a click, event-end and event-start give same value.
  (let ((position (event-end event)))
    (if (not (windowp (posn-window position)))
        (error "Position not in text area of window"))
    (select-window (posn-window position))
    (let ((pt (posn-point position)))
      (if (numberp pt)
          ;; is there a fake cursor with the actual *point* right where we are?
          (unless (evil-mc-undo-cursor-at-pos pt)
            (save-excursion
              (goto-char pt)
              (evil-mc-make-cursor-here)))))))
(map! "C-<down-mouse-1>" nil)
(map! "C-<mouse-1>" #'evil-mc/toggle-cursor-on-click)
#+end_src

**** Objetos de texto
