packages.el

(package! websocket)
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))

(package! org-ql)

(package! seoul256-theme)

(package! elcord)
