config.org
***** Org headlines
#+begin_src elisp :tangle tangle/minor/evil.el
(defun evil-org--parse-headline ()
  (save-excursion
    (end-of-line)
    (outline-previous-heading)
    (skip-chars-forward "* \t")
    (let* ((todo-start     (point))
           (todo-end1      (and org-todo-regexp
                                (let (case-fold-search) (looking-at (concat org-todo-regexp " ")))
                                (goto-char (1- (match-end 0)))))
           (todo-end2      (when todo-end1 (skip-chars-forward " \t") (point)))
           (priority-start (point))
           (priority-end   (when (looking-at "\\[#.\\][ \t]*") (goto-char (match-end 0))))
           (_              (and (let (case-fold-search) (looking-at org-comment-string))
                                (goto-char (match-end 0))))
           (title-start    (point))
           (tags-start     (when (re-search-forward "[ \t]+\\(:[[:alnum:]_@#%:]+:\\)[ \t]*$"
                                                    (line-end-position) 'move)
                             (goto-char (match-beginning 0))
                             (match-beginning 1)))
           (title-end      (point)))
      (list todo-start todo-end1 todo-end2 priority-start
            priority-end title-start title-end
            tags-start (line-end-position)))))

(evil-define-text-object evil-org-headline (count &optional beg end type)
  "Select the current org heading" :jump t
  (save-excursion
    (end-of-line)
    (outline-previous-heading)
    (list (line-beginning-position) (line-end-position))))

(evil-define-text-object evil-org-headline-title (c &rest _)
  "Select the title text in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (list (nth 5 parse) (nth 6 parse))))

(evil-define-text-object evil-org-headline-todo (c &rest _)
  "Select the todo entry in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (list (nth 0 parse) (nth 2 parse))))

(evil-define-text-object evil-org-headline-inner-todo (c &rest _)
  "Select the inner todo entry in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (list (nth 0 parse) (nth 1 parse))))

(evil-define-text-object evil-org-headline-priority (c &rest _)
  "Select the priority entry in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (list (nth 3 parse) (nth 4 parse))))

(evil-define-text-object evil-org-headline-tags (c &rest _)
  "Select the tags in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (list (nth 6 parse) (nth 8 parse))))

(evil-define-text-object evil-org-headline-inner-priority (c &rest r)
  "Select the inner part of priority in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (when (nth 4 parse)
      (let ((p (+ 2 (nth 3 parse)))) (list p (1+ p))))))

(evil-define-text-object evil-org-headline-inner-tags (c &rest _)
  "Select the inner part of tags in the current org heading" :jump t
  (let ((parse (evil-org--parse-headline)))
    (when (nth 7 parse)
      (list (1+ (nth 7 parse)) (1- (nth 8 parse))))))

(map! :map 'evil-inner-text-objects-map
      "h h" #'evil-org-headline-title
      "h t" #'evil-org-headline-inner-todo
      "h p" #'evil-org-headline-inner-priority
      "h a" #'evil-org-headline-inner-tags)

(map! :map 'evil-outer-text-objects-map
      "h h" #'evil-org-headline
      "h t" #'evil-org-headline-todo
      "h p" #'evil-org-headline-priority
      "h a" #'evil-org-headline-tags)
#+end_src

*** Flyspell

Vamos deixá-lo menos preguiçoso: @performance

#+begin_src emacs-lisp
(setq flyspell-lazy-idle-seconds 0.4)
#+end_src

Com o =flyspell-correct=, vamos adicionar alguns atalhos:

#+begin_src emacs-lisp
(map! :ni "C-." #'flyspell-correct-move)
#+end_src
*** Focus
#+begin_src emacs-lisp
(setq focus-fraction 0.7)
(custom-set-faces!
  '(focus-unfocused :inherit custom-comment-tag :foreground "gray"))
#+end_src

*** Iedit

Desativa uma mensagem chata quando apertamos =M-d=

#+begin_src emacs-lisp
(setq iedit-toggle-key-default nil)
#+end_src

*** Lisps
**** Parinfer

 - =paren= Mode gives you full control of parens, while Parinfer corrects
   indentation. You can still adjust indentation, but you won't be able to
   indent/dedent past certain boundaries set by parens on previous lines.
   
 - =indent= Mode gives you full control of indentation, while Parinfer
   corrects or inserts close-parens where appropriate. Specifically, it only
   touches the groups of close-parens at the end of each line.

 - =smart= Mode is like Indent Mode, but it tries to preserve the structure too.
   
NOTE TO SELF: =smart= and =indent= won't allow inserting unmached }

#+begin_src emacs-lisp
(setq parinfer-rust-preferred-mode "indent")
#+end_src

*** Mamimo

#+begin_src emacs-lisp
(setq mamimo-greek-abbrevs-prefix ";")
(add-hook! 'mamimo-mode-hook
  (evil-tex-mode +1))
#+end_src

*** Mixed-pitch

#+begin_src emacs-lisp
(defface my-mixed-pitch-face
  '((t :family "Overpass" :weight light))
  "Face for `mixed-pitch-mode'")
(setq mixed-pitch-face 'my-mixed-pitch-face
      mixed-pitch-set-height nil)
#+end_src

*** Org
**** Org-appear :ARCHIVE:

Faz os elementos de markup desaparecerem automaticamente.

#+begin_src emacs-lisp :tangle packages.el
(package! org-appear)
#+end_src

#+begin_src emacs-lisp
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks nil))
#+end_src

*** Vertico :completion:

#+begin_src emacs-lisp :tangle tangle/minor/vertico.el
(vertico-reverse-mode +1)
(setq vertico-resize t
      vertico-count 10)
#+end_src
*** Yasnippet
**** Movimentos entre campos
Uma dessas coisas que se imagina, por que não fizeram assim?

#+begin_src elisp :tangle tangle/minor/yasnippet.el
;;; tangle/minor/yasnippet.el -*- lexical-binding: t; -*-
(defun yas--maybe-move-to-active-field (snippet)
  "Try to move to SNIPPET's active (or first) field and return it if found."
  (let ((target-field (or (yas--snippet-active-field snippet)
                          (car (yas--snippet-fields snippet)))))
    (when target-field
      (yas--move-to-field snippet target-field)
      (goto-char (yas--field-end target-field))
      target-field)))
#+end_src

** Carregar
O trecho a seguir carrega os arquivos de configurações nos diretórios
=lisp/major= e =lisp/minor=, e faz com que cada arquivo seja carregado apenas
depois do módulo de mesmo nome ser carregado (com a função =after!=).
#+begin_src emacs-lisp
(dolist (type '(major minor features))
  (let ((folder (format "~/.doom.d/lisp/%s/" type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
#+end_src

#+begin_src emacs-lisp
(dolist (type '(major minor features))
  (let ((folder (format "%stangle/%s/" doom-private-dir type)))
    (dolist (file (file-expand-wildcards (concat folder "*.el")))
      (let ((f (file-name-sans-extension (file-name-nondirectory file))))
        (eval `(after! ,(intern f) (load! ,f ,folder)))))))
#+end_src

* Atalhos de teclado
** Fazer o binding =SPC s I= abrir a sessão com narrowing
#+begin_src emacs-lisp
(map! :mode 'org-mode
      :map 'doom-leader-search-map
      "I" (cmd! (funcall-interactively (key-binding " si"))
                (org-tree-to-indirect-buffer)))
#+end_src

** Comandos familiares

Porque ninguém merece tantos atalhos diferentes.

#+begin_src emacs-lisp
;; (map! "C-S-s" 'isearch-forward)
(map! :egni "C-s" 'save-buffer)
(map! :egni "C-/" 'evilnc-comment-or-uncomment-lines)

(map! :i "C-v" 'yank)
(map! :i "C-z" 'evil-undo)
(map! :i "C-S-z" 'evil-redo)
(map! :i "C-x" 'evil-delete)
#+end_src

** Linhas visuais
#+begin_src emacs-lisp
(map! :map evil-motion-state-map
      "j" 'evil-next-visual-line
      "k" 'evil-previous-visual-line
      "<down>" 'evil-next-visual-line
      "<up>" 'evil-previous-visual-line)
#+end_src

** Evil ABNT :ARCHIVE:

Nossos teclados têm uma tecla a mais no melhor lugar possível, não podemos
desperdiçar a oportunidade de usar =jklç=:

#+begin_src emacs-lisp :tangle no
;; no dia em que eu precisar usar teclado americano, eu vou me arrepender...

(map! :map minibuffer-local-map
      "C-k" #'next-line
      "C-l" #'previous-line
      :i "C-k" #'next-line
      :i "C-l" #'previous-line)

(map! :map evil-motion-state-map
      "j" 'evil-backward-char
      "k" 'evil-next-visual-line
      "l" 'evil-previous-visual-line
      "ç" 'evil-forward-char)

(map! :map evil-window-map
      ;; Navigation
      "j"       #'evil-window-left
      "k"       #'evil-window-down
      "l"       #'evil-window-up
      "ç"       #'evil-window-right
      "C-j"     #'evil-window-left
      "C-k"     #'evil-window-down
      "C-l"     #'evil-window-up
      "C-ç"     #'evil-window-right
      ;; Swapping windows
      "J"       #'+evil/window-move-left
      "K"       #'+evil/window-move-down
      "L"       #'+evil/window-move-up
      "Ç"       #'+evil/window-move-right)

(map! :i "M-J" 'evil-backward-char
      :i "M-K" 'evil-next-line
      :i "M-L" 'evil-previous-line
      :i "M-Ç" 'evil-forward-char)

(after! treemacs (evil-define-key 'treemacs treemacs-mode-map "l" nil "h" nil))

;; (evil-define-key '(visual normal) Info-mode-map "l" nil)
(map! :map Info-mode-map :vn "l" nil)

(map! :after treemacs
      :map evil-treemacs-state-map
      "j"      #'treemacs-COLLAPSE-action
      "k"      #'treemacs-next-line
      "l"      #'treemacs-previous-line
      "ç"      #'treemacs-RET-action)
#+end_src

** Hydras
Uma história antiga.

Não gosto do estilo do pop up
#+begin_src emacs-lisp
(setq hydra-is-helpful nil)
#+end_src

Tamanho da janela
#+begin_src emacs-lisp
(defhydra window-height-hydra (evil-window-map)
  "window height"
  ("=" evil-window-increase-height "")
  ("-" evil-window-decrease-height "")
  (">" evil-window-increase-width "")
  ("<" evil-window-decrease-width ""))

(defhydra workspace-hydra (doom-leader-workspace-map)
  "workspace"
  ("]" +workspace/switch-right "")
  ("[" +workspace/switch-left "")
  ("}" +workspace/swap-right "")
  ("{" +workspace/swap-left ""))
#+end_src

** Kitty (Terminal)
#+begin_src emacs-lisp
(map! :prefix-map ("\x80" . "kitty C map")
      :map 'key-translation-map
      "/" "C-/")

(map! :prefix-map ("\x81" . "kitty C-S map")
      :map 'key-translation-map
      "z" (kbd "C-S-z"))
#+end_src

** Edit leader key
#+begin_src emacs-lisp
(map! :leader
      :prefix ("e" . "edit")
      :desc "New snipet" "s" #'+snippets/new
      :desc "New alias" "a" #'+snippets/new-alias)

(map! :i "C-M-x" ctl-x-map)
#+end_src

** Centralizar ao procurar com o evil
#+begin_src emacs-lisp
;; (evil-define-motion search-previous-and-recenter (count)
;;   :jump t
;;   :type exclusive
;;   (evil-ex-search-previous count)
;;   (call-interactively #'evil-scroll-line-to-center))

;; (map! :n [remap evil-ex-search-previous] #'search-previous-and-recenter)
#+end_src

** Outros

#+begin_src emacs-lisp
(map! "M-j" 'drag-stuff-down
      "M-k" 'drag-stuff-up)

(map! :map lean-mode-map "M-." 'lean-find-definition)

(map! :map TeX-mode-map "C-S-s" 'TeX-command-run-all)
#+end_src
